fix: README minor fixes - Iteration-2
